[
  {
    "Id": "dell",
    "Ratings": null,
    "Brand": "Dell",
    "ProductName": "Dell 16 Plus",
    "ProductType": 5,
    "Url": "https://www.dell.com/en-us/shop/dell-laptops/dell-16-plus-laptop/spd/dell-db16250-laptop",
    "ProductDescription": "Processor: Intel® Core™ Ultra 7 256V (47 TOPS NPU, 8 cores, up to 4.8 GHz); OS: Windows 11 Home, Copilot\u002B PC; Graphics: Intel® Arc™ Graphics; Display: 16\u0022 2.5K (2560 x 1600) Anti-Glare Non-Touch, 300 nits, WVA/IPS, ComfortView Plus; Memory: 16GB LPDDR5X 8533MT/s onboard; Storage: 1TB M.2 PCIe NVMe SSD; Case: Ice Blue; Office: Microsoft 365 30-day trial; Security: McAfee\u002B Premium 30-day trial; Support: 12-month Basic Onsite after remote diagnosis; Accidental Damage: None; Keyboard: English backlit with Copilot key and numeric keypad; Ports: 1x USB 3.2 Gen 1 (5Gbps), 1x USB 3.2 Gen 2 Type-C (10Gbps, DP 1.4, PD), 1x Thunderbolt 4 (DP 2.1, PD), 1x HDMI 2.1, 1x universal audio jack; Dimensions: 0.67\u0022 H x 14.05\u0022 W x 9.87\u0022 D (16.99mm x 356.78mm x 250.60mm); Weight: 4.12 lbs (1.87 kg); Touchpad: Precision touchpad (Mylar); Camera: 1080p FHD at 30fps, dual-array mics; Audio: Dual speakers with Waves MaxxAudio® Pro and Dolby Atmos, 2.5W x 2; Chassis: Aluminum LCD cover/base, plastic bezel/palmrest; Wireless: Intel® Wi-Fi 7 BE201 2x2, Bluetooth; Battery: 4-cell 64WHr integrated; Power Adapter: 65W USB-C; Palmrest: Ice Blue with fingerprint reader",
    "Image": "/assets/laptop_dell_16_plus.png"
  },
  {
    "Id": "apple",
    "Ratings": null,
    "Brand": "Apple",
    "ProductName": "15-inch MacBook Air - Sky Blue",
    "ProductType": 5,
    "Url": "https://www.apple.com/shop/buy-mac/macbook-air/15-inch-sky-blue-m4-chip-with-10-core-cpu-10-core-gpu-24gb-memory-512gb",
    "ProductDescription": "Chip: Apple M4 with 10-core CPU (4 performance, 6 efficiency), 8-core GPU, 16-core Neural Engine, 120GB/s memory bandwidth; Media Engine: Hardware-accelerated H.264, HEVC, ProRes, ProRes RAW, AV1 decode; Configurable to 10-core GPU; Apple Intelligence supported; Display: 13.6-inch Liquid Retina, 2560x1664, 224 PPI, 500 nits brightness, P3 color, True Tone; Memory: 16GB unified memory (configurable to 24GB or 32GB); Battery: Up to 18 hrs video, 15 hrs web, 53.8Wh battery, 30W USB-C Power Adapter (8-core GPU) or 35W Dual USB-C Adapter (10-core GPU), fast-charge with 70W adapter; Storage: 256GB SSD (configurable to 512GB, 1TB, 2TB); Ports: MagSafe 3, 3.5mm headphone jack, 2x Thunderbolt 4/USB-C (40Gb/s); Display Support: Built-in \u002B 2x external 6K@60Hz displays, DisplayPort 1.4 over USB-C; Video Playback: HEVC, H.264, AV1, ProRes, Dolby Vision, HDR10\u002B, HLG; Audio Playback: AAC, MP3, Apple Lossless, FLAC, Dolby Digital/Plus/Atmos; Keyboard: Backlit Magic Keyboard with 78/79 keys, Touch ID, ambient light sensor; Trackpad: Force Touch with pressure-sensing and Multi‑Touch; Wireless: Wi-Fi 6E, Bluetooth 5.3; Camera: 12MP Center Stage, 1080p HD, Desk View, computational video; Audio: Four-speaker system, Spatial Audio, 3-mic array with beamforming, Voice Isolation \u0026 Wide Spectrum, high-impedance headphone support; Operating Requirements: 100-240V AC, 50-60Hz, 10–35°C, up to 10,000 ft altitude; Dimensions: 0.44\u0022 H x 11.97\u0022 W x 8.46\u0022 D (1.13 cm x 30.41 cm x 21.5 cm); Weight: 2.7 lbs (1.24 kg)",
    "Image": "/assets/laptop_apple_macbook_15in_sky_blue.png"
  },
  {
    "Id": "rog_asus",
    "Ratings": null,
    "Brand": "ROG Asus",
    "ProductName": "ROG Strix SCAR 18 (2025) G835",
    "ProductType": 5,
    "Url": "https://rog.asus.com/us/laptops/rog-strix/rog-strix-scar-18-2025/",
    "ProductDescription": "Operating System: Windows 11 Pro; Processor: Intel® Core™ Ultra 9 275HX (2.7 GHz, up to 5.4 GHz, 24 cores/24 threads, 36MB Cache) with Intel® AI Boost NPU up to 13TOPS; Graphics: NVIDIA® GeForce RTX™ 5070 Ti Laptop GPU, ROG Boost 1565MHz at 140W, 12GB GDDR7; Display: 18-inch 2.5K WQXGA (2560x1600), 16:10 aspect, Anti-glare, 100% DCI-P3, Pantone Validated, Dolby Vision HDR supported; Memory: 16GB DDR5-5600 SO-DIMM (expandable to 64GB, dual channel); Storage: 1TB PCIe 4.0 NVMe M.2 SSD; Expansion Slots: 2x DDR5 SO-DIMM, 2x M.2 PCIe; I/O Ports: 1x 3.5mm combo jack, 1x HDMI 2.1 FRL, 3x USB 3.2 Gen 2 Type-A, 2x Thunderbolt™ 5 (DisplayPort, power delivery, G-SYNC), 1x 2.5G LAN; Keyboard: Backlit Chiclet Keyboard with per-key RGB; Touchpad: Precision touchpad with Copilot key; Camera: 1080p FHD IR Camera with Windows Hello; Audio: 4-speaker Smart Amp system, Dolby Atmos, AI noise-canceling, Hi-Res headphone support, built-in mic; Wireless: Wi-Fi 7 (802.11be), Bluetooth® 5.4; Battery: 90WHr, 4-cell Li-ion; Power Supply: 380W AC Adapter (20V, 19A); RGB Lighting: AURA SYNC logo and light bar, AniMe Vision; Weight: 3.30 kg (7.28 lbs); Dimensions: 39.9 x 29.8 x 2.35 ~ 3.20 cm (15.71\u0022 x 11.73\u0022 x 0.93\u0022 ~ 1.26\u0022); Office: 1-month Microsoft 365 trial; Xbox Game Pass: 3 months for PC (terms apply); Security: Firmware TPM, BIOS Password Protection, McAfee 30-day trial",
    "Image": "/assets/laptop_rog_strix_scar_18_2025_g835.png"
  },
  {
    "Id": "razer",
    "Ratings": null,
    "Brand": "Razer",
    "ProductName": "Razer Blade 18",
    "ProductType": 5,
    "Url": "https://www.razer.com/gaming-laptops/razer-blade-18/RZ09-05297ER3-R3U1",
    "ProductDescription": "Color: Black; OS: Windows 11 Home; Graphics: NVIDIA GeForce RTX 5070 Ti with 12 GB GDDR7 VRAM and Dynamic Boost (\u002B25 W); Display: Dual Mode 18-Inch UHD\u002B 240Hz (3840x2400) and FHD\u002B 440Hz (1920x1200) IPS; Processor: Intel® Core™ Ultra 9 275HX (24-Cores / 24-Threads, up to 5.4 GHz Max Turbo) with Intel® Graphics; Storage: 1 TB SSD M.2 NVMe PCIe 4.0; Memory: 32 GB DDR5-5600 MHz; Keyboard: US Layout, per-key RGB with Razer Chroma™, N-Key rollover; Connectivity: Wi-Fi 7, Bluetooth 5.4, WLAN tri-band 2x2 802.11a/b/g/n/ac/ax/be; Touchpad: Precision glass touchpad; I/O Ports: 3 x USB 3.2 Gen 2 Type-A, 1 x Thunderbolt™ 5 (Type-C, DisplayPort 2.1 via Nvidia GPU, PD 3.0 up to 100W), 1 x Thunderbolt™ 4 (Type-C, DisplayPort 2.1 via iGPU, PD 3.0 up to 100W), RJ45 - 2.5Gb Ethernet, HDMI 2.1, UHS-II SD Card Reader; Audio: 6-speaker array (2 tweeters, 4 subs), 3 smart amplifiers, 3.5mm combo jack, dual-array mic, THX® Spatial Audio, 7.1 codec via HDMI; Finish: CNC-Milled Aluminum, Anodized Black with Fingerprint Resistive Coating, Backlit Green Razer Logo; Dimensions: 21.99 mm ~ 27.94 mm x 275.4 mm x 399.96 mm (0.86\u0022 ~ 1.1\u0022 x 10.84\u0022 x 15.74\u0022); Weight: 3.10 kg / 7.06 lbs; Battery: Built-in 99 WHr lithium-ion polymer; Power Adapter: 400 W; Additional Features: Windows Hello IR 5MP Webcam, Mechanical Privacy Shutter, Synapse 4 support, Kensington Security Slot, Modern Standby, Intel PTT (sTPM 2.0); Warranty: 1-year limited laptop warranty, 2-year limited battery warranty",
    "Image": "/assets/laptop_razer_blade_18.png"
  },

  {
    "Id": "logitech",
    "Ratings": null,
    "Brand": "Logitech",
    "ProductName": "POP Keyboard",
    "ProductType": 7,
    "Url": "https://www.logitech.com/en-us/shop/p/pop-keys-wireless-mechanical.920-010709",
    "ProductDescription": "Dimensions: Height 5.45 in (138.47 mm), Width 12.65 in (321.2 mm), Depth 1.39 in (35.4 mm), Weight (with batteries): 27.48 oz (779 g); Connection Type: Bluetooth Low Energy Wireless (Bluetooth 5.1); Wireless Range: 33 ft (10 m); Switch Type: Mechanical (Brown, tactile); Battery: 2 x AAA; Battery Life: 36 months; Indicator Lights: Battery LED, 3 Bluetooth channel LEDs, Caps Lock LED; Customization App: Supported by Logi Options\u002B on Windows and macOS; System Requirements: Bluetooth Low Energy - Windows 10/11 or later, macOS 10.15 or later, iPadOS 13.4 or later, iOS 11 or later, ChromeOS, Android 8 or later; Logi Bolt USB Receiver - Windows 10/11 or later, macOS 10.15 or later, ChromeOS; Internet Access: Required for Logi Options\u002B download; Warranty: 1-Year Limited Hardware Warranty; Part Numbers: Heartbreaker English - 920-010709, Mist English - 920-011232, Cosmos English - 920-011233",
    "Image": "/assets/keyboard_logitech_pop.png"
  },
  {
    "Id": "ducky",
    "Ratings": null,
    "Brand": "Ducky",
    "ProductName": "DOOM® Edition One 3 SF",
    "ProductType": 7,
    "Url": "https://ducky.global/products/one-3-sf-doom%C2%AE-edition",
    "ProductDescription": "Layout: 65%; Connectivity: Wired; Structure: Mechanical structure; Switches: Cherry MX mechanical switches (Black, Brown, Blue, Red, Speed, Silent Red); Hot-swappable: Yes; Cable: Detachable USB Type-C Cable; Keycap Material: PBT Double-shot; Ghosting: N-Key Rollover; Dimensions: 335 x 110 x 40 mm; Weight: 700 g",
    "Image": "/assets/keyboard_ducky_doom_edition_one_3_sf.png"
  },
  {
    "Id": "razer",
    "Ratings": null,
    "Brand": "Razer",
    "ProductName": "Razer Pro Type Ultra",
    "ProductType": 7,
    "Url": "https://www.razer.com/productivity/razer-pro-type-ultra",
    "ProductDescription": "Switch Type: Razer™ Yellow Mechanical Switch; Key Feel: Linear and Silent; Size: Full Size; Lighting: Backlit keys (white LED); Wrist Rest: Yes; Onboard Memory: None; Media Keys: Yes; Passthrough: None; Connectivity: Wired USB-C, wireless via Bluetooth® and Razer™ HyperSpeed (2.4GHz); Keycaps: ABS plastic with soft touch coating; Features: Full-sized keyboard with soft-touch coating, Multi-host connection for up to 4 devices, Fully programmable keys with macro recording, Razer™ Productivity Dongle for connecting keyboard and compatible mice, 10-key rollover, Metal top cover, Razer Synapse 3 enabled; Battery Life: Up to ~214 hours without backlighting on Bluetooth®, ~207 hours on 2.4GHz wireless, ~13 hours on both with backlighting at full brightness; Approx. Size: 439 mm x 131 mm x 40 mm; Approx. Weight: 1038 g (including cable)",
    "Image": "/assets/keyboard_razer_pro_type_ultra.png"
  },
  {
    "Id": "corsair",
    "Ratings": null,
    "Brand": "Corsair",
    "ProductName": "VANGUARD PRO 96 Hall Effect Gaming Keyboard",
    "ProductType": 7,
    "Url": "https://www.corsair.com/us/en/p/keyboards/ch-91e911g-na/vanguard-pro-96-hall-effect-gaming-keyboard-ch-91e911g-na",
    "ProductDescription": "Media and Volume Controls: Yes; Wrist Rest Included: Magnetic detachable, with leatherette cover and memory foam cushion; Keyboard Report Rate: Up to 8,000Hz; Keyboard Color: Black; On Board Memory: 8MB; Onboard Profiles: 5; Adjustable Height: Yes; Wired Connectivity: USB 3.0 or 3.1 Type-A; Keyboard Connectivity: Wired; Keyboard Cable Material: Braided; WIN Lock: FN Shortcut; Media Keys: FN Shortcuts; Key Rollover: Full Key (NKRO) with 100% Anti-Ghosting; Key Switches: CORSAIR MGX V2; Keyboard Layout: NA (North America); Keyboard Warranty: 2 Year; Keyboard Compatibility: PC, Mac, or XBOX One with USB 3.0 or 3.1 Type-A port, Windows® 10 or macOS® 10.15, CORSAIR WEB HUB software; Weight: 1.095kg",
    "Image": "/assets/keyboard_corsair_vanguard_pro_96_hall_effect_gaming.png"
  },
  {
    "Id": "apple",
    "Ratings": null,
    "Brand": "Apple",
    "ProductName": "Magic Mouse (USB‑C) - Black Multi-Touch Surface",
    "ProductType": "Mice",
    "Url": "https://www.apple.com/shop/product/MXK63AM/A/magic-mouse-usb%E2%80%91c-black-multi-touch-surface?fnode=37a8dceadcd1bd0898498344d4e729a4951e0ed5624deb669a93be927a9df5e5b6e77e865537962505e265664f7719ab573948b74e3532cb06c7b9707084245f73be6b3bc6fc8f56c3b5804ea441647820bc422921372d2586029461e082ce2e",
    "ProductDescription": "Overview: Wireless and rechargeable Magic Mouse with optimized foot design for smooth gliding and Multi-Touch surface for gestures like swiping and scrolling; Rechargeable battery lasts about a month between charges; USB-C port included with woven USB-C Charge Cable for charging and pairing; What’s in the Box: Magic Mouse, USB-C Charge Cable; Size and Weight: Height 0.85 inch (2.16 cm), Width 2.25 inches (5.71 cm), Depth 4.47 inches (11.35 cm), Weight 0.22 lb (0.099 kg); General: Multi-Touch; Connections and Expansion: Bluetooth, USB-C port, Wireless; System Requirements: Mac with macOS 15.1 or later, iPad with iPadOS 18.1 or later",
    "Image": "/assets/mice_apple_magic_mouse_usb_c.png"
  },
  {
    "Id": "corsair",
    "Ratings": null,
    "Brand": "Corsair",
    "ProductName": "M75 WIRELESS Lightweight RGB Gaming Mouse – Glacier Blue",
    "ProductType": "Mice",
    "Url": "https://www.corsair.com/us/en/p/gaming-mouse/CH-931D01G-NA/m75-wireless-lightweight-rgb-gaming-mouse-glacial-blue-ch-931d01g-na",
    "ProductDescription": "Weight: 89 g; Sensor Type: Optical; Grip Type: Any; Battery Life: 2.4GHz SLIPSTREAM - Up to 105 hrs, Bluetooth® - Up to 210 hrs; On Board Memory Profiles: 1; Game Genre: FPS, MMO, Battle Royale; Sensor: MARKSMAN 26K; DPI: 26,000; Mouse Compatibility: PC or Mac® with USB 2.0 Type-A port, Windows® 10/11, macOS® 10.15 or later, Internet connection for iCUE software download",
    "Image": "/assets/mice_corsair_m75_wireless_lightweight.png"
  },
  {
    "Id": "razer",
    "Ratings": null,
    "Brand": "Razer",
    "ProductName": "Razer Pro Click V2 Vertical",
    "ProductType": "Mice",
    "Url": "https://www.razer.com/productivity/razer-pro-click-v2-vertical-edition",
    "ProductDescription": "Form Factor: Right-handed; Connectivity: Razer HyperSpeed Wireless (2.4 GHz), Bluetooth – up to 3 hosts, USB-C wired; Battery Life: Up to 6 months; RGB Lighting: 18 zone underglow; Sensor: Razer Focus Pro Optical Sensor; Max Sensitivity (DPI): 30000; Max Speed (IPS): 550; Max Acceleration (G): 40; Programmable Buttons: 8; Switch Type: Mechanical switch; Switch Lifecycle: 60-million Clicks; On-board Memory Profiles: 1; Mouse Feet: 100% PTFE; Cable: 1.2 m USB-A to USB-C cable for charging and wired usage; Tilt Scroll Wheel: None; Size (L x W x H): 111.0 mm / 4.37 in x 88.0 mm / 3.46 in x 79.0 mm / 3.11 in; Weight: Approx. 150 g; Accessory Compatibility: None; Box Contents: Razer Pro Click V2 Vertical Edition, Razer HyperSpeed Wireless Dongle, USB Type A to USB Type C cable, Important Product Information Guide",
    "Image": "/assets/mice_razer_pro_click_v2_vertical_edition.png"
  },
  {
    "Id": "logitech",
    "Ratings": null,
    "Brand": "Logitech",
    "ProductName": "G502 X PLUS",
    "ProductType": "Mice",
    "Url": "https://www.logitech.com/en-us/shop/p/g502-x-plus-wireless-lightforce.910-006160",
    "ProductDescription": "Dimensions - Height: 1.62 in (41.1 mm); Width: 3.12 in (79.2 mm); Length: 5.17 in (131.4 mm); Weight: 3.74 in (106 g); USB-C Charging: Black - Yes; 106 grams: Black - Yes; Low-friction PTFE feet: Black - Yes; System Requirements: USB port, Internet access for optional software download; Platform Compatibility: Windows® 10 or later, Mac 10.14 or later; Warranty: 2-Year Limited Hardware Warranty; Part Number: Black - 910-006160, White - 910-006169",
    "Image": "/assets/mice_logitech_g502_x_plus_wireless.png"
  },
  {
    "Id": "sennheiser",
    "Ratings": null,
    "Brand": "Sennheiser",
    "ProductName": "HD 490 PRO",
    "ProductType": "Headset",
    "Url": "https://www.sennheiser.com/en-us/catalog/products/headphones/hd-490-pro/hd-490-pro-700286",
    "ProductDescription": "Weight: 260 gr. (w/o cable); Max. sound pressure level: 128 dBSPL (1 kHz @ 5% THD); Power consumption: 300 mW (100 h, noise IEC 60268); Sensitivity: 105 dBSPL (1 kHz/1 Vrms), 96 dBSPL (1 kHz/1 mW); Transducer type: Dynamic; Wearing style: Over-ear; Connection: Wired; Connectors: 3.5mm, 6.3mm",
    "Image": "/assets/headset_sennheiser_hd_490_pro.png"
  },
  {
    "Id": "sony",
    "Ratings": null,
    "Brand": "Sony",
    "ProductName": "WH-1000XM6 Best Wireless Noise Canceling Headphones | Platinum Silver",
    "ProductType": "Headset",
    "Url": "https://electronics.sony.com/audio/headphones/headband/p/wh1000xm6-s",
    "ProductDescription": "What\u0027s In The Box: Carrying case, Headphone cable (approx. 1.2m), USB charging cable; Noise Canceling: Personal NC Optimizer, Adaptive NC Optimizer; Quick Attention: Yes; Ambient Sound Mode - Normal: Yes; Bluetooth® Version: BLUETOOTH Specification Version 5.3; Effective Range: Approx. 10 m; Frequency Range: 2.4 GHz band (2.4000 GHz - 2.4835 GHz); Profile: A2DP, AVRCP, HFP, HSP, TMAP, PBP; Supported Audio Formats: SBC, AAC, LDAC, LC3; Supported Content Protection: SCMS-T; Battery Charge Method: USB; Battery Life (Music Playback): Max. 30 hours (NC ON), Max. 40 hours (NC OFF); Battery Life (Communication Time): Max. 24 hours (NC ON), Max. 28 hours (NC OFF); Lithium Battery: Yes; Weight: Approx. 254 g; Frequency Response: 4 Hz - 40,000 Hz (JEITA); Cord Length: Approx. 1.2 m; Cord Type: Single-sided (detachable); Driver Unit: 30 mm; Impedance: 48 ohm (1 kHz, power ON), 16 ohm (1 kHz, power OFF); Magnet: Neodymium; Plug: Gold-plated L-shaped stereo mini plug; Sensitivities: 103 dB/mW (power ON), 102 dB/mW (power OFF); Wearing Style: Over Ear; Headphone Type: Closed; Frequency Response (Active): 4 Hz - 40,000 Hz (JEITA); Frequency Response (Bluetooth®): 20 Hz - 20,000 Hz (44.1 kHz), 20 Hz - 40,000 Hz (LDAC, 96 kHz, 990 kbps); Passive Operation: Yes; Ambient Sound Mode: Yes",
    "Image": "/assets/headset_sony_wh-1000xm6_noise_cancellation.png"
  },
  {
    "Id": "sony",
    "Ratings": null,
    "Brand": "Sony",
    "ProductName": "WF-1000XM5 The Best Truly Wireless Noise Canceling Earbuds | Black",
    "ProductType": "Headset",
    "Url": "https://electronics.sony.com/audio/headphones/truly-wireless-earbuds/p/wf1000xm5-b",
    "ProductDescription": "Charging Case Dimension: Approx. 64.6 x 40.0 x 26.5 mm; Charging Case Weight: Approx. 39 g; Noise Canceling Ambient Sound Mode: Yes; Quick Attention: Yes; Bluetooth® Version: Bluetooth Specification Version 5.3; Effective Range: 10 m; Frequency Range: 2.4 GHz band (2.4000 GHz - 2.4835 GHz); Profile: A2DP, AVRCP, HFP, HSP, TMAP, CSIP, MCP, VCP, CCP; Supported Audio Formats: SBC, AAC, LDAC, LC3; Supported Content Protection: SCMS-T; Battery Charge Method: USB charger | Wireless charger (with case); Battery Life (Communication Time): Max. 6 hrs (NC ON) | Max. 7 hrs (NC OFF); Battery Life (Active Headphones): Max. 8 hrs (NC ON) | Max. 12 hrs (NC OFF); Earbud Weight: Approx. 5.9 g x 2 (including earbud tips (M)); Driver Unit: 8.4 mm; Wearing Style: Yes (IPX4 equivalent); Headphone Type: Closed, dynamic; Frequency Response (Bluetooth®): 20–20,000 Hz (44.1 kHz sampling) | 20–40,000 Hz (LDAC 96 kHz sampling 990 kbps); Ambient Sound Mode: Yes; General Features (Active Headphones): Yes",
    "Image": "/assets/headset_sony_wf_1000xm5_truly_wireless_earbuds.png"
  },
  {
    "Id": "bose",
    "Ratings": null,
    "Brand": "Bose",
    "ProductName": "Bose QuietComfort Ultra Headphones",
    "ProductType": "Headset",
    "Url": "https://www.bose.com/p/headphones/bose-quietcomfort-ultra-headphones/QCUH-HEADPHONEARN.html?dwvar_QCUH-HEADPHONEARN_color=DEEP\u002BPLUM\u0026quantity=1",
    "ProductDescription": "Headphone Fit: Around Ear Circumaural; Headband: On Head Adjustable; Cushions: Removable Cushion; Microphones: Built-in Microphone; Noise Cancelling: Yes; Noise Control Type: Active Noise Cancelling, Echo Reduction, Adjustable Noise Cancelling; Audio cable included: No; Case: Carry; Headphone Dimensions: 7.7\u0022 H x 5.5\u0022 W x 2.0\u0022 D (0.560 lb); Product Material: Plastic, Aluminum, Leather (Protein); Product Case Material: Plastic (Hard); Ear Cushion Material: Protein Leather; Rechargeable: Yes; Battery Life: 24 hours; Battery Charge Time: 3 hours; Charging Accessory included: Yes; Charging Interface(s): USB C PORT; Wireless Connectivity: Bluetooth, A2DP Bluetooth Audio Streaming, HFP Bluetooth, AVRCP Bluetooth, Bluetooth Low Energy; Bose App: Bose App",
    "Image": "/assets/headset_bose_quitecomfort_ultra.png"
  },
  {
    "Id": "meta",
    "Ratings": null,
    "Brand": "Meta",
    "ProductName": "Meta Quest 3",
    "Url": "https://www.meta.com/quest/quest-3/buy-now/",
    "ProductType": 17,
    "ProductDescription": "Power:\nAdvanced hardware stack and the first headset with the Snapdragon XR2 Gen 2, delivering double the GPU processing power for faster load times and more seamless gameplay compared to Meta Quest 2. This brings enough power to support heavy applications like fast-action gaming, seamless full-color, high-resolution passthrough and so much more.\n\nStorage:\n512GB. Higher storage allows you to download more experiences to your headset, or video content for offline viewing.\n\nMixed reality:\n2 RGB cameras with 18 PPD for 4.5X better passthrough resolution, in full color, compared to Quest 2. Delivers high-fidelity views of your surroundings while you see virtual objects appear in your physical space. Accurate depth projection and room mapping gives you freedom to move throughout your space and interact with virtual characters or objects in the room around you.\n\nAudio:\nIntegrated stereo speakers with 3D spatial audio places you in your space with 40% louder audio range, bass range and optimal L/R matching capabilities. 3.5mm audio jack for headphones and sound output to external audio devices.\n\nDRAM:\n8GB. 33% more memory compared with Meta Quest 2, giving you more support to play your favorite apps with optimal performance.\n\nErgonomics:\nComfort:\nPremium slim design for balanced, lightweight comfort.\nStrap design:\nSoft adjustable strap accommodates a variety of head shapes and hairstyles; Hard strap is available and sold separately.\nDepth adjustment:\nEasily adjust the facial interface closer or farther from your face to improve comfort and field of view.\nHeadset weight:\n515 grams. Quest 3 is 30% slimmer than Quest 2.*\n*Excluding the facial interface.\n\nDisplay and optics technology:\nDisplay resolution:\n2064x2208 pixels per eye enhances resolution by nearly 30% compared to Meta Quest 2 for next-level clarity and lifelike graphics. 4K\u002B Infinite Display with 25 PPD and 1218 PPI brings the best resolution across the entire Quest line of devices.\nRefresh rate:\n72Hz, 90Hz, 120Hz.\nField of view:\n110 degrees horizontal and 96 degrees vertical. This extends your peripheral vision to let you see more of virtual worlds, all at once, for the most immersive experiences yet.\nOptics:\nPancake lens. Increased sharpness by 25% in center FOV (~70% sharper in periphery), with significantly less stray or scattered light artifacts.*\n*As compared to Quest 2.\n\nEye tracking:\nNot featured.\n\nMeta Quest Touch Plus Controllers:\nComfort:\nPlay comfortably with a streamlined, ring-free design. Experience more natural movement and precise input as if they’re a natural extension of your hands.\nHaptics:\nTruTouch variable haptics provide tactile feedback, enabling a more holistic range of in-experience sensations so you can touch, move and react realistically within virtual environments.\n\nExperience:\nMixed reality passthrough:\n2 RGB Color cameras and depth projector for improved depth and resolution.\nDirect touch hand tracking:\nAdvanced hybrid computer vision and machine learning sensors follow your gestures, with 4 IR cameras and 2 RGB cameras to enable controller-free navigation and more intuitive control. Simply move your hands to tap, scroll, navigate and play.\n\nContent library:\nThousands of experiences. There’s something for everyone to discover in more immersive ways, thanks to mixed reality and better performance enabling faster load times, seamless play and ultra-realistic graphics.\n\nBackwards compatibility:\nAccess to the entire catalog of Meta Quest apps, games and experiences. Keep playing your favorite titles you previously downloaded on Quest 2. Play the newest games and apps that are exclusively available on Quest 3 and 3S.\n\nPC support:\nSupported with Meta Quest Link Cable and Air Link to connect your headset to the power of your PC to unlock yet another level of gameplay (available separately).\n\nCharging:\nBattery life:\n- Up to 2.2 hours of usage on average\n- Gaming: 2.4 hours of usage on average\n- Social: 2.2 hours of usage on average\n- Productivity: 1.5 hours of usage on average\n- Media: 2.9 hours of usage on average\nAs with most battery powered devices, battery life is dependent on various factors such as device settings, usage, age of battery, Bluetooth usage, and wireless conditions.\n\nCharge time:\nApproximately 2.3 hours with the included 18W power adapter (headset only).\n\nEasy charging:\nBuilt-in USB-C port for charging and connectivity. Contact pads on bottom of device simplify charging, when combined with the external dock accessory (available separately).",
    "Image": "/assets/vrheadset_meta_quest_3.png"
  },
  {
    "Id": "vive",
    "Ratings": null,
    "Brand": "Vive",
    "ProductName": "Vive Pro 2 Headset",
    "ProductType": 17,
    "Url": "https://www.vive.com/us/product/vive-pro2/overview/",
    "ProductDescription": "In-box Items:\n- VIVE Pro 2 headset\n- All-in-one cable\n- Link box\n- Mini DP to DP Adapter\n- 18W x1 AC adapter\n- Lens cleaning cloth\n- Lens protection card\n- Ear caps\n- DP cable\n- USB 3.0 cable\n- Spec label\n- Documentations (QSG / Safety Guide / Warranty / IPD Guide / VIVE Logo Sticker)\n\nHeadset Specs:\nBrief Highlights:\n1. Immerse yourself in next-gen visuals with industry-leading 5K resolution, wide 120˚ field of view, and an ultra-smooth 120Hz refresh rate.\n2. Feel fully immersed with the equipped Hi-Res Certified headphones.\n3. Experience best in class tracking performance and comfort.\n\nScreen: Dual RGB low persistence LCD\nResolution: 2448 × 2448 pixels per eye (4896 x 2448 pixels combined)\nRefresh Rate: 90/120 Hz (only 90Hz supported via VIVE Wireless Adapter)\nField of view: Up to 120 degrees (horizontal)\n\nAudio:\n- Hi-Res certified headset (via USB-C analog signal)\n- Hi-Res certified headphones (removable)\n- High impedance headphones support (via USB-C analog signal)\n\nInputs: Integrated dual microphones\nConnections: Bluetooth, USB-C port for peripherals\n\nSensors:\n- G-sensor\n- Gyroscope\n- Proximity sensor\n- IPD sensor\n- SteamVR Tracking V2.0 (compatible with SteamVR 1.0 and 2.0 base stations)\n\nErgonomics:\n- Eye relief with lens distance adjustment\n- Adjustable IPD 57-70mm\n- Adjustable headphones\n- Adjustable headstrap",
    "Image": "/assets/vrheadset_vive_pro_2.png"
  },
  {
    "Id": "playstation",
    "Ratings": null,
    "Brand": "PlayStation",
    "ProductName": "PlayStation VR2",
    "ProductType": 17,
    "Url": "https://www.playstation.com/en-us/ps-vr2/",
    "ProductDescription": "PlayStation 2 VR Headset:\nDisplay method: OLED\nPanel resolution: 2000 x 2040 per eye\nPanel refresh rate: 90Hz, 120Hz\nLens separation: Adjustable\nField of View: Approx. 110 degrees\nSensors:\n  - Motion sensor: Six-axis motion sensing system (three-axis gyroscope, three-axis accelerometer)\n  - Attachment sensor: IR proximity sensor\nCameras:\n  - 4 embedded cameras for headset and controller tracking\n  - IR camera for eye tracking per eye\nFeedback: Vibration on the headset\nCommunication with PS5: USB Type-C®\nAudio:\n  - Input: Built-in microphone\n  - Output: Stereo headphone jack\n\nPlayStation 2 VR Sense Controller:\nButtons:\n  - Right: PS button, Options button, Action buttons (Circle / Cross), R1 button, R2 button, Right Stick / R3 button\n  - Left: PS button, Create button, Action buttons (Triangle / Square), L1 button, L2 button, Left Stick / L3 button\nSensing/Tracking:\n  - Motion Sensor: Six-axis motion sensing system (three-axis gyroscope \u002B three-axis accelerometer)\n  - Capacitive sensor: Finger touch detection\n  - IR LED: Position tracking\nFeedback: Trigger effect (on R2/L2 button), haptic feedback (by single actuator per unit)\nPort: USB Type-C®\nCommunication: Bluetooth® Ver5.1\nBattery:\n  - Type: Built-in lithium-ion rechargeable battery",
    "Image": "/assets/vrheadset_playstation_vr2.png"
  },
  {
    "Id": "apple",
    "Ratings": null,
    "Brand": "Apple",
    "ProductName": "Apple Vision Pro",
    "ProductType": 17,
    "Url": "https://www.apple.com/shop/buy-vision/apple-vision-pro",
    "ProductDescription": "Capacity: 256GB, 512GB, 1TB; Display: 23 million pixels, 3D micro-OLED, 7.5‑micron pixel pitch, 92% DCI‑P3, 90/96/100Hz refresh rates, judder-free playback at 24fps and 30fps; Video Mirroring: Up to 720p AirPlay to AirPlay-enabled devices; Chips: Apple M2 (8-core CPU: 4 performance, 4 efficiency; 10-core GPU; 16-core Neural Engine; 16GB unified memory), R1 chip (12ms photon-to-photon latency, 256GB/s memory bandwidth); Camera: Stereoscopic 3D, spatial capture, 18mm ƒ/2.00, 6.5 stereo MP; Sensors: 2 high-res main cameras, 6 tracking cams, 4 eye-tracking cams, TrueDepth, LiDAR, 4 IMUs, flicker \u002B ambient light sensors; Authentication: Optic ID (iris scan, encrypted in Secure Enclave), used for purchases and app security; Audio: Spatial Audio, dynamic head tracking, audio ray tracing, six-mic array, directional beamforming, ultra-low-latency H2-to-H2 with AirPods Pro 2 (USB-C) and AirPods 4; Audio Playback: AAC, MP3, Apple Lossless, FLAC, Dolby Digital, Dolby Digital Plus, Dolby Atmos; Video Playback: HEVC, MV‑HEVC, H.264, HDR (Dolby Vision, HDR10, HLG); Battery: Up to 2 hrs general use, 2.5 hrs video, can be used while charging; Connectivity: Wi‑Fi 6 (802.11ax), Bluetooth 5.3; OS: visionOS 26; Input: Hands, Eyes, Voice; Accessories: Supports keyboards, trackpads, game controllers, Bluetooth mouse (visionOS 2\u002B); Interpupillary Distance (IPD): 51–75mm; Weight: 600–650g device \u002B 353g battery; Accessibility: Includes VoiceOver, Zoom, Color Filters, Hearing Device Support, Closed Captioning, Voice Control, Switch Control, Dwell Control, Pointer Control, Made for iPhone hearing aids and switch controllers support",
    "Image": "/assets/vrheadset_apple_vision_pro.png"
  },
  {
    "Id": "bambustore",
    "Ratings": null,
    "Brand": "Bambu Store",
    "ProductName": "Bambu Lab H2D",
    "ProductType": 20,
    "Url": "https://us.store.bambulab.com/products/h2d?srsltid=AfmBOopoTqSUERALdJFluHOkTohIdvoEiOV6nvHuiuhMbbVREc7HDJ7U",
    "ProductDescription": "Printing Technology: Fused Deposition Modeling; Build Volume: Single 325x320x325 mm³, Dual 300x320x325 mm³, Total Dual 350x320x325 mm³; Chassis: Aluminum, Steel, Plastic, Glass; Laser Module: 10W/40W (455nm blue light), Engraving Area 310x270 mm / 310x250 mm, Class 1 overall safety, up to 15mm cutting; Toolhead: All-metal hotend, hardened steel nozzle (0.4mm included, 0.2–0.8mm supported), 350°C max temp, 1.75mm filament; Print Speed: 1000 mm/s max, 20,000 mm/s² acceleration, 40 mm³/s (std), 65 mm³/s (high flow); Heatbed: Up to 120°C, supports PEI plates; Chamber: Heated (65°C), HEPA \u002B carbon filters; Filaments Supported: PLA, ABS, PETG, TPU, PA, ASA, CF/GF blends, more; Sensors: Live/Nozzle/BirdsEye/Toolhead Cameras, filament runout, tangle, odometry, door sensor, power loss recovery; Dimensions: 492x514x626 mm³, 31 kg; Electronics: 5-inch touchscreen, 8GB storage, NPU (2 TOPS), USB port, mobile/PC app control; Connectivity: Wi-Fi (2.4GHz \u0026 5GHz, 802.11 a/b/g/n); Power: 100–240V, 2200W max; Software: Bambu Studio/Suite/Handy, supports G-code from Cura, PrusaSlicer, etc.; Laser Cutting: Materials—wood, rubber, leather, acrylic, metal sheet, etc.; Cutting Module: 300x285 mm cutting area, blade pressure 50–600gf, 0.5mm max thickness, LightGrip/StrongGrip mats; Safety: Flame/temp detection, safety key, ventilation adapter (100mm)",
    "Image": "/assets/3dprinter_bamustore_bambulab_h2d.png"
  },
  {
    "Id": "prusa",
    "Ratings": null,
    "Brand": "Prusa",
    "ProductName": "Prusa Core One",
    "ProductType": 20,
    "Url": "https://www.prusa3d.com/product/prusa-core-one/",
    "ProductDescription": "Build Volume: 250x220x270 mm; Filament Diameter: 1.75 mm; Layer Height: 0.05-0.30 mm; Printer Size: 415x444x555 mm, 22.5 kg; Electronics: Custom 32-bit xBuddy with STM32, Trinamic 2130 stepper drivers; Extruder: Nextruder Direct Drive, E3D V6 compatible, 10:1 planetary gear, max nozzle temp 290°C; Nozzle: 0.4 mm high-flow Prusa brass; Heatbed: Magnetic PEI spring steel, max 120°C; Chamber: max 55°C; Controls: 3.5-inch color touchscreen, USB/Prusa Connect/Firmware update, quick-swap nozzle, lighting; Connectivity: Ethernet, optional Wi-Fi; Sensors: filament (2), loadcell, thermistors (5), door, fan monitoring; Printing via USB/LAN/Internet; Auto bed leveling with load cell; Supports PLA, PETG, Flex, PVA, PC, PP, CPE, PVB, ABS (with filtration); Power: 240W PSU, power panic hardware; Optional accessories: internal camera, HEPA filtration, GPIO, accelerometer; Features input shaping and phase stepping.",
    "Image": "/assets/3dprinter_prusa_core_one.png"
  },
  {
    "Id": "creality",
    "Ratings": null,
    "Brand": "Creality",
    "ProductName": "K1C",
    "ProductType": 20,
    "Url": "https://www.creality.com/products/k1c-carbon-3d-printer",
    "ProductDescription": "Printing Tech: FFF; Build Volume: 220x220x250 mm; Layer Height: 0.1-0.35 mm; Printing Accuracy: ±0.1 mm; Max Speed: ≤600 mm/s; Acceleration: ≤20000 mm/s²; Motion System: CoreXY; Extruder: Direct Drive; Nozzle: 0.4 mm steel-tipped integrated with heatbreak, max temp 300°C; Heatbed: max 100°C, flexible build plate; Filament Diameter: 1.75 mm; Supported Filaments: ABS, PLA, PETG, PET, TPU, PA, ASA, PC, CF variants; Leveling: Full-auto; Input Shaping: Yes; AI Monitoring Camera with Timelapse; Display: 4.3\u0022 Color Touchscreen; Connectivity: USB, Wi-Fi, Creality Cloud; Remote Control: Yes; Firmware OTA Updates: Yes; File Format: G-code; Storage: 8 GB; Languages: English, German, Spanish, French, Italian, Portuguese, Russian, Turkish, Japanese, Korean, Chinese; Sensors: filament run-out, power loss recovery; Air filter and lighting kit included; Rated Power: 100-240V, 50/60Hz; Dimensions: 355x355x482 mm; Weight: 12.4 kg; Frame: Enclosed.",
    "Image": "/assets/3dprinter_creality_k1c.png"
  },
  {
    "Id": "flashforge",
    "Ratings": null,
    "Brand": "FlashForge",
    "ProductName": "FlashForge Adventurer 5M",
    "ProductType": 20,
    "Url": "https://www.flashforge.com/products/adventurer-5m-3d-printer?srsltid=AfmBOoqPhunATTqmkhWcvMcKDNEmTQ7u2F3jlqdXrzaOaURWGcGh1BGK",
    "ProductDescription": "Machine: Adventurer 5M; Display: 4.3-inch; Nozzle Sizes: 0.25/0.4/0.6/0.8 mm; Slicing Software: FlashPrint 5, Orca-Flashforge, Orca Slicer; Build Volume: 220x220x220 mm; Build Plate: Flexible removable PEI steel plate; Supported Filaments: PLA, PETG (0.4mm nozzle recommended), TPU, PLA-CF, PETG-CF (0.6mm nozzle); Power Supply: AC 100-120/200-240V, 50/60Hz, 350W; Max Platform Temp: 100°C; Shell: Open; Max Acceleration: 20000 mm/s²; Features: Filament run-out reminder, Power loss recovery; Dimensions: 363x376x413 mm (without display/spool), 363x402x448 mm (with display, without spool); Extruder: Direct drive, single; Max Extruder Temp: 280°C; Connectivity: Wi-Fi, Ethernet, USB; Max Travel Speed: 600 mm/s.",
    "Image": "/assets/3dprinter_flashforge_adventurer_5m.png"
  }
]